//by Mrwang2408
//<RCN_overlays.h>


int runChunkBorder(vec3 cp) {
	vec3 bp = fract(cp);
	if (
		((cp.x < 0.0625 || cp.x > 15.9375) && (cp.z < 0.0625 || cp.z > 15.9375)) || 
		((cp.y < 0.0625 || cp.y > 15.9375) && (cp.x < 0.0625 || cp.x > 15.9375)) || 
		((cp.y < 0.0625 || cp.y > 15.9375) && (cp.z < 0.0625 || cp.z > 15.9375))) {
		if (cp.x < 0.0625 && cp.z < 0.0625) {
			return 3; //y轴绿色显示
		} else if (cp.z < 0.0625 && cp.x < 15.9375) {
			return 4; //x轴红色显示
		} else if (cp.x < 0.0625) {
			return 5; //z轴蓝色显示
		} else {
			return 2; //其于部分蓝色显示
		};
	} else if (
		((cp.x < 0.09375 || cp.x > 15.90625) || (cp.z < 0.09375 || cp.z > 15.90625)) && (
		((bp.x < 0.03125 || bp.x > 0.96875) && (bp.y < 0.03125 || bp.y > 0.96875)) || 
		((bp.x < 0.03125 || bp.x > 0.96875) && (bp.z < 0.03125 || bp.z > 0.96875)) ||
		((bp.y < 0.03125 || bp.y > 0.96875) && (bp.z < 0.03125 || bp.z > 0.96875)))) {
		return 1;  //每方块刻度白线
	};
	return 0;
}
	
	
/*
int runChunkBorder(vec3 cp) {
	vec3 bp = fract(cp);
	if (
		((cp.x < 0.125 || cp.x > 15.875) && (cp.z < 0.125 || cp.z > 15.875)) || 
		((cp.y < 0.125 || cp.y > 15.875) && (cp.x < 0.125 || cp.x > 15.875)) || 
		((cp.y < 0.125 || cp.y > 15.875) && (cp.z < 0.125 || cp.z > 15.875))
	) {
		if (
		((cp.x < 0.0625 || cp.x > 15.9375) && (cp.z < 0.0625 || cp.z > 15.9375)) || 
		((cp.y < 0.0625 || cp.y > 15.9375) && (cp.x < 0.0625 || cp.x > 15.9375)) || 
		((cp.y < 0.0625 || cp.y > 15.9375) && (cp.z < 0.0625 || cp.z > 15.9375))
		) {
			if (cp.x < 0.125 && cp.z < 0.125) {
				return 3; //y轴绿色显示
			} else if (cp.z < 0.125 && cp.x < 15.875) {
				return 4; //x轴红色显示
			} else if (cp.x < 0.125) {
				return 5; //z轴蓝色显示
			} else {
				return 2; //其于部分蓝色显示
			};
		} else if (
			((bp.x < 0.03125 || bp.x > 0.96875) && (bp.y < 0.03125 || bp.y > 0.96875)) || 
			((bp.x < 0.03125 || bp.x > 0.96875) && (bp.z < 0.03125 || bp.z > 0.96875)) ||
			((bp.y < 0.03125 || bp.y > 0.96875) && (bp.z < 0.03125 || bp.z > 0.96875))
		) {
			if (cp.x < 0.125 && cp.z < 0.125) {
				return 3; //y轴绿色显示
			} else if (cp.z < 0.125 && cp.x < 15.875) {
				return 4; //x轴红色显示
			} else if (cp.x < 0.125) {
				return 5; //z轴蓝色显示
			} else {
				return 2; //其于部分蓝色显示
			};
		};
	} else if (
		((cp.x < 0.09375 || cp.x > 15.90625) || (cp.z < 0.09375 || cp.z > 15.90625))
	) {
		if (
			((bp.x < 0.03125 || bp.x > 0.96875) && (bp.y < 0.03125 || bp.y > 0.96875)) || 
			((bp.x < 0.03125 || bp.x > 0.96875) && (bp.z < 0.03125 || bp.z > 0.96875)) ||
			((bp.y < 0.03125 || bp.y > 0.96875) && (bp.z < 0.03125 || bp.z > 0.96875))
		) {
			return 1;  //每方块刻度白线
		};
	};
	return 0;
}
*/
	
	
	
	
bool runRsOverlay(vec3 color, vec3 cp) {
	vec3 bp = fract(cp);//bPos: 每方块坐标（1x1x1）
	#ifdef INVERT_NUM
	bp = 1.0 - bp;  //是否倒转字体
	#endif
	bp.x = bp.x * 3.0 - 1.1;
	bp.z = bp.z * 3.0 - 1.1;
	if (
		(bp.x <= 0.7 && bp.x >= 0.1 && bp.z <= 0.08 && bp.z >= 0.05) ||
		(bp.x <= 0.7 && bp.x >= 0.1 && bp.z <= 0.2 && bp.z >= 0.17)) {
		return true;  //预绘制两条横线
	} else if (color.r > 0.2930392 && color.r < 0.3030392 && (color.g + color.b) < 0.005) {
		if (
		(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.25) || 
		(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.25) || 
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65) || 
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.35 && bp.z >= 0.25)) {
		return true;  //红石强度0
		};
	} else if (color.r > 0.999 && color.g > 0.1910784 && color.g < 0.2010784 && color.b < 0.005) {
		if (
		(bp.x <= 0.7 && bp.x >= 0.1 && bp.z <= 0.15 && bp.z >= 0.1) || 
		(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) || 
		(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) || 
		(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) || 
		(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.55 && bp.z >= 0.45) || 
		(bp.x <= 0.2 && bp.x >= 0.1 && bp.z <= 0.55 && bp.z >= 0.25) || 
		(bp.x <= 0.4 && bp.x >= 0.3 && bp.z <= 0.75 && bp.z >= 0.45) || 
		(bp.x <= 0.3 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.65) || 
		(bp.x <= 0.4 && bp.x >= 0.2 && bp.z <= 0.35 && bp.z >= 0.25)) {
		return true;  //红石强度15
		};
	} else if (color.r > 0.4342157 && color.r < 0.4442157 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(1.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) || 
		(bp.x <= 0.55 && bp.x >= 0.25 && bp.z <= 0.35 && bp.z >= 0.25) || 
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.35) || 
		(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.65)) {
		return true;  //红石强度1
		};
	} else if (color.r > 0.4734314 && color.r < 0.4834314 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(2.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) || 
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
		(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.45) || 
		(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.55 && bp.z >= 0.25) || 
		(bp.x <= 0.45 && bp.x >= 0.25 && bp.z <= 0.35 && bp.z >= 0.25) || 
		(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65)) {
		return true;  //红石强度2
		};
	} else if (color.r > 0.5126471 && color.r < 0.5226471 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(3.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) || 
		(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.25) || 
		(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
		(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.35 && bp.z >= 0.25) || 
		(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65)) {
		return true;  //红石强度3
		};
	} else if (color.r > 0.5518628 && color.r < 0.5618628 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(4.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) || 
		(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.25) || 
		(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.45) || 
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45)) {
		return true;  //红石强度4
		};
	} else if (color.r > 0.595 && color.r < 0.605 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(5.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) || 
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
		(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.55 && bp.z >= 0.25) || 
		(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.45) || 
		(bp.x <= 0.45 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.65) || 
		(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.35 && bp.z >= 0.25)) {
		return true;  //红石强度5
		};
	} else if (color.r > 0.6342157 && color.r < 0.6442157 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(6.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) ||
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
		(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.55 && bp.z >= 0.25) || 
		(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.35) || 
		(bp.x <= 0.45 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.65) || 
		(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.35 && bp.z >= 0.25)) {
		return true;  //红石强度6
		};
	} else if (color.r > 0.6734314 && color.r < 0.6834314 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(7.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) || 
		(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.25) || 
		(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65) || 
		(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.65 && bp.z >= 0.55)) {
		return true;  //红石强度7
		};
	} else if (color.r > 0.7126471 && color.r < 0.7226471 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(8.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) || 
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
		(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.25) || 
		(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.25) || 
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65) || 
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.35 && bp.z >= 0.25)) {
		return true;  //红石强度8
		};
	} else if (color.r > 0.7518628 && color.r < 0.7618628 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(9.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) ||
		(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
		(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.35) || 
		(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.45) || 
		(bp.x <= 0.55 && bp.x >= 0.25 && bp.z <= 0.35 && bp.z >= 0.25) || 
		(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65)) {
		return true;  //红石强度9
		};
	} else if (color.r > 0.795 && color.r < 0.805 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(10.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) || 
		(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) ||
		(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) ||
		(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) ||
		(bp.x <= 0.2 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.25) ||
		(bp.x <= 0.4 && bp.x >= 0.3 && bp.z <= 0.75 && bp.z >= 0.25) ||
		(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.75 && bp.z >= 0.65) ||
		(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.35 && bp.z >= 0.25)) {
		return true;  //红石强度10
		};
	} else if (color.r > 0.8342157 && color.r < 0.8442157 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(11.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) ||
		(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) ||
		(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) ||
		(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) ||
		(bp.x <= 0.4 && bp.x >= 0.1 && bp.z <= 0.35 && bp.z >= 0.25) ||
		(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.75 && bp.z >= 0.35) ||
		(bp.x <= 0.4 && bp.x >= 0.3 && bp.z <= 0.75 && bp.z >= 0.65)) {
		return true;  //红石强度11
		};
	} else if (color.r > 0.8734314 && color.r < 0.8834314 && (color.g + color.b) < 0.005) {
		if (
		(mod(floor(12.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) ||
		(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) ||
		(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) ||
		(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) ||
		(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.55 && bp.z >= 0.45) ||
		(bp.x <= 0.2 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.45) ||
		(bp.x <= 0.4 && bp.x >= 0.3 && bp.z <= 0.55 && bp.z >= 0.25) ||
		(bp.x <= 0.3 && bp.x >= 0.1 && bp.z <= 0.35 && bp.z >= 0.25) ||
		(bp.x <= 0.4 && bp.x >= 0.2 && bp.z <= 0.75 && bp.z >= 0.65)) {
		return true;  //红石强度12
		};
	} else if (color.r > 0.9126471 && color.r < 0.9226471 && color.g > 0.01852941 && color.g < 0.02852941 && color.b < 0.005) {
		if (
		(mod(floor(13.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) ||
		(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) ||
		(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) ||
		(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) ||
		(bp.x <= 0.2 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.25) ||
		(bp.x <= 0.4 && bp.x >= 0.2 && bp.z <= 0.55 && bp.z >= 0.45) ||
		(bp.x <= 0.4 && bp.x >= 0.2 && bp.z <= 0.35 && bp.z >= 0.25) ||
		(bp.x <= 0.4 && bp.x >= 0.2 && bp.z <= 0.75 && bp.z >= 0.65)) {
		return true;  //红石强度13
		};
	} else if (color.r > 0.9518628 && color.r < 0.9618627 && color.g > 0.1008824 && color.g < 0.1108824 && color.b < 0.005) {
		if (
		(mod(floor(14.0 / exp2(floor(6.666667 * (bp.x - 0.1)))), 2.0) >= 0.5 && bp.z <= 0.15 && bp.z >= 0.1) ||
		(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) ||
		(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) ||
		(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) ||
		(bp.x <= 0.2 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.25) ||
		(bp.x <= 0.4 && bp.x >= 0.3 && bp.z <= 0.75 && bp.z >= 0.45) ||
		(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.55 && bp.z >= 0.45)) {
		return true;  //红石强度14
		};
	};
	return false;
}





int runLiOverlay(vec2 lightUV, vec3 cp) {
	int set = 0;
	float light = 0.0;
	vec3 bp = fract(cp);
	bp.x = bp.x * 3.0 - 1.1;
	bp.z = bp.z * 3.0 - 1.1;
	bp.x = bp.x - 0.13;
	if (bp.x <= 0.7 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.25) {
		set = 1;
		light =lightUV.x; //中心区域选择方块光照
	} else {
		bp.x = ((bp.x * 2.0) + 0.55);
		bp.z = ((bp.z * 2.0) - 0.25);
		if (bp.x <= 0.7 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.25) {
			set = 5;
			light =lightUV.y;  //右下方选择天空光照
		};
	};
	if (set != 0) {
		if (light <0.0625) {
			if (
			(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.25)||
			(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.25)||
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65)||
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.35 && bp.z >= 0.25)) {
			set += 2;  //光照等级0
			};
		} else if (light >= 0.9375) {
			if (
			(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) || 
			(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.55 && bp.z >= 0.45) || 
			(bp.x <= 0.2 && bp.x >= 0.1 && bp.z <= 0.55 && bp.z >= 0.25) || 
			(bp.x <= 0.4 && bp.x >= 0.3 && bp.z <= 0.75 && bp.z >= 0.45) || 
			(bp.x <= 0.3 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.4 && bp.x >= 0.2 && bp.z <= 0.35 && bp.z >= 0.25)) {
			set += 1;  //光照等级15
			};
		} else if (light >= 0.0625 && light < 0.125) {
			if (
			(bp.x <= 0.55 && bp.x >= 0.25 && bp.z <= 0.35 && bp.z >= 0.25) ||
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.35) || 
			(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.65)) {
			set += 1;  //光照等级1
			};
		} else if (light >= 0.125 && light < 0.1875) {
			if (
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
			(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.45) || 
			(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.55 && bp.z >= 0.25) || 
			(bp.x <= 0.45 && bp.x >= 0.25 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65)) {
			set += 1;  //光照等级2
			};
		} else if (light >= 0.1875 && light < 0.25) {
			if (
			(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.25) || 
			(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
			(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65)) {
			set += 1;  //光照等级3
			};
		} else if (light >= 0.25 && light < 0.3125) {
			if (
			(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.25) || 
			(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.45) || 
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45)) {
			set += 1;  //光照等级4
			};
		} else if (light >= 0.3125 && light < 0.375) {
			if (
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
			(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.55 && bp.z >= 0.25) || 
			(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.45) || 
			(bp.x <= 0.45 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.35 && bp.z >= 0.25)) {
			set += 1;  //光照等级5
			};
		} else if (light >= 0.375 && light < 0.4375) {
			if (
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
			(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.55 && bp.z >= 0.25) || 
			(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.35) || 
			(bp.x <= 0.45 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.35 && bp.z >= 0.25)) {
			set += 1;  //光照等级6
			};
		} else if (light >= 0.4375 && light < 0.5) {
			if (
			(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.25) || 
			(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.65 && bp.z >= 0.55)) {
			set += 1;  //光照等级7
			};
		} else if (light >= 0.5 && light < 0.5625) {
			if (
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
			(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.25) || 
			(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.25) || 
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.35 && bp.z >= 0.25)) {
			set += 1;  //光照等级8
			};
		} else if (light >= 0.5625 && light < 0.625) {
			if (
			(bp.x <= 0.45 && bp.x >= 0.35 && bp.z <= 0.55 && bp.z >= 0.45) || 
			(bp.x <= 0.35 && bp.x >= 0.25 && bp.z <= 0.75 && bp.z >= 0.35) || 
			(bp.x <= 0.55 && bp.x >= 0.45 && bp.z <= 0.75 && bp.z >= 0.45) || 
			(bp.x <= 0.55 && bp.x >= 0.25 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.55 && bp.x >= 0.35 && bp.z <= 0.75 && bp.z >= 0.65)) {
			set += 1;  //光照等级9
			};
		} else if (light >= 0.625 && light < 0.6875) {
			if (
			(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) || 
			(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.2 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.25) || 
			(bp.x <= 0.4 && bp.x >= 0.3 && bp.z <= 0.75 && bp.z >= 0.25) || 
			(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.35 && bp.z >= 0.25)) {
			set += 1;  //光照等级10
			};
		} else if (light >= 0.6875 && light < 0.75) {
			if (
			(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) || 
			(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.4 && bp.x >= 0.1 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.75 && bp.z >= 0.35) || 
			(bp.x <= 0.4 && bp.x >= 0.3 && bp.z <= 0.75 && bp.z >= 0.65)) {
			set += 1;  //光照等级11
			};
		} else if (light >= 0.75 && light < 0.8125) {
			if (
			(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) || 
			(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.55 && bp.z >= 0.45) || 
			(bp.x <= 0.2 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.45) || 
			(bp.x <= 0.4 && bp.x >= 0.3 && bp.z <= 0.55 && bp.z >= 0.25) || 
			(bp.x <= 0.3 && bp.x >= 0.1 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.4 && bp.x >= 0.2 && bp.z <= 0.75 && bp.z >= 0.65)) {
			set += 1;  //光照等级12
			};
		} else if (light >= 0.8125 && light < 0.875) {
			if (
			(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) || 
			(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.2 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.25) || 
			(bp.x <= 0.4 && bp.x >= 0.2 && bp.z <= 0.55 && bp.z >= 0.45) || 
			(bp.x <= 0.4 && bp.x >= 0.2 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.4 && bp.x >= 0.2 && bp.z <= 0.75 && bp.z >= 0.65)) {
			set += 1;  //光照等级13
			};
		} else if (light >= 0.875 && light < 0.9375) {
			if (
			(bp.x <= 0.7 && bp.x >= 0.4 && bp.z <= 0.35 && bp.z >= 0.25) || 
			(bp.x <= 0.6 && bp.x >= 0.5 && bp.z <= 0.75 && bp.z >= 0.35) || 
			(bp.x <= 0.7 && bp.x >= 0.6 && bp.z <= 0.75 && bp.z >= 0.65) || 
			(bp.x <= 0.2 && bp.x >= 0.1 && bp.z <= 0.75 && bp.z >= 0.25) || 
			(bp.x <= 0.4 && bp.x >= 0.3 && bp.z <= 0.75 && bp.z >= 0.45) || 
			(bp.x <= 0.3 && bp.x >= 0.2 && bp.z <= 0.55 && bp.z >= 0.45)) {
			set += 1;  //光照等级14
			};
		};
	};
	if (lightUV.x > 0.0615 && lightUV.x < 0.0625) {
		set = 4;  //边缘线指示
	} else if (lightUV.y > 0.0615 && lightUV.y < 0.0625) {
		set = 8;  //边缘线指示
	};
	if (!(set == 0 || set == 1 || set == 5)) {
		return set;
	} else {
		return 0;
	};
}





